import numpy as np 

# #------------------------------------------------------------------------------#
# B=np.arange(3)
# print(B)
# print(np.exp(B))    #exp為自然常數e  e0=1  e1=2.718..   e3=7.389..
# print(np.sqrt(B))   #根號  
# #------------------------------------------------------------------------------#
# #變換矩陣形狀
# print("------向下取整--------")
# a = np.floor(10*np.random.random((3,4)))  #向下取整
# print(a)
# print("------弄平(flatten)矩陣--------")
# ##a shpae
# #弄平(flatten)矩陣
# print(a.ravel())
# print("------從新組合--------")
# a.shape =(6,2)
# print(a)
# print("------轉置矩陣--------")
# print(a.T)
# #補充：a.reshape(3,-1)代表指定3行就可以確定列 寫一個-1就是自動幫你算
# print(a.reshape(3,-1))
# #------------------------------------------------------------------------------#
# #矩陣拼接
# """floor定義:標量x的底數是最大的整數i 所以 x表示 i。
# 例子
# >>> a = np.array([-1.7, -1.5, -0.2, 0.2, 1.5, 1.7, 2.0])
# >>> np.floor(a)
# array([-2., -2., -1.,  0.,  1.,  1.,  2.])
# """
# a = np.floor(10*np.random.random((2,2)))
# b = np.floor(10*np.random.random((2,2)))
# print("-------a--------")
# print(a)
# print("-------b--------")
# print(b)
# print("-------hstack橫向拼接---")
# print(np.hstack((a,b)))
# print("--------縱向拼接--------")
# print(np.vstack((a,b)))
# #------------------------------------------------------------------------------#
# #矩陣切分
# a = np.floor(10*np.random.random((2,12)))
# print(a)
# print("-----橫向切分------")
# print(np.hsplit(a,3))  #橫向切分
# print("-----------")
# print(np.hsplit(a,(3,4)))  #在第三和第四列之後拆分
# print("-----------")
a = np.floor(10*np.random.random((12,2)))
print(a)
print("----縱向切分-------")
print(np.vsplit(a,3))#縱向切分

# #------------------------------------------------------------------------------#










